app/views/contests/_contest.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
<%= contest.long %>
<%= User.find(contest.user_id).name %>