app/views/pigeons/_pigeon.html.erb

<%= pigeon.longitude %>
<%= Contest.find(pigeon.contest_id).name %>
---
SELECT  "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT 1  [["id", 1]]