app/views/events/_event.html.erb

<div><%= event.content %></div>
<div><%= User.find(event.user_id).name %></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]