app/controllers/contests_controller.rb

SELECT "users".* FROM "users"
---
	def show
		@user = User.all

INSERT INTO "contests" ("name", "lat", "long", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asd"], ["lat", 12.5], ["long", 165.2], ["user_id", 1], ["created_at", "2015-12-13 09:58:47.762794"], ["updated_at", "2015-12-13 09:58:47.762794"]]
---
	def create
  	@contest = current_user.contests.build(contest_params)
  	if @contest.save

SELECT  "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT 1  [["id", nil]]
---
	def edit
		$idshow = params[:id]
		@contest = Contest.find(params[:id])

SELECT  "contests".* FROM "contests" WHERE "contests"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "pigeons" ("code", "lat", "long", "contest_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["code", "321fdsbc"], ["lat", 125.25], ["long", 21.5], ["contest_id", 1], ["created_at", "2015-12-13 11:51:41.329071"], ["updated_at", "2015-12-13 11:51:41.329071"]]
---
	def create_pigeon
		@contest = Contest.find($idshow)
		@pigeon = @contest.pigeons.build(pigeon_params)
  	if @pigeon.save