app/controllers/events_controller.rb

	def show
		@user = User.all
---
SELECT "users".* FROM "users"

	def create
  	@event = current_user.events.build(event_params)
  	if @event.save
---
INSERT INTO "events" ("header", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["header", "fdsf"], ["content", "vrev"], ["user_id", 2], ["created_at", "2015-12-12 11:28:53.917268"], ["updated_at", "2015-12-12 11:28:53.917268"]]