app/views/layouts/_header.html.erb

SELECT "pigeons".* FROM "pigeons"
---
    function functie() {
      a = <%= Pigeon.all.map{|m| m.attributes}.
     to_json.gsub("</script", "<\"+\"/script").html_safe %>;